mrk-its/esphome/esphome/components/stm32/gpio.cpp
#ifdef USE_STM32

#include "gpio.h"
#include "esphome/core/log.h"

namespace esphome {
namespace stm32 {

static const char *const TAG = "stm32";

static GPIO_TypeDef *GPIO_PORTS[9] = {
#ifdef GPIOA
    GPIOA,
#else
    nullptr,
#endif
#ifdef GPIOB
    GPIOB,
#else
    nullptr,
#endif
#ifdef GPIOC
    GPIOC,
#else
    nullptr,
#endif
#ifdef GPIOD
    GPIOD,
#else
    nullptr,
#endif
#ifdef GPIOE
    GPIOE,
#else
    nullptr,
#endif
#ifdef GPIOF
    GPIOF,
#else
    nullptr,
#endif
#ifdef GPIOG
    GPIOG,
#else
    nullptr,
#endif
#ifdef GPIOH
    GPIOH,
#else
    nullptr,
#endif
#ifdef GPIOI
    GPIOI
#else
    nullptr
#endif
};

GPIO_TypeDef *pin_to_port(uint8_t pin) {
  uint8_t pin_nr = pin >> 4;
  if (pin_nr < 9)
    return GPIO_PORTS[pin_nr];
  return nullptr;
}

uint16_t pin_to_mask(uint8_t pin) { return 1 << (pin & 0xf); }

struct ISRPinArg {
  uint8_t pin;
  bool inverted;
};

ISRInternalGPIOPin STM32GPIOPin::to_isr() const {
  auto *arg = new ISRPinArg{};  // NOLINT(cppcoreguidelines-owning-memory)
  arg->pin = pin_;
  arg->inverted = inverted_;
  return ISRInternalGPIOPin((void *) arg);
}

void STM32GPIOPin::attach_interrupt(void (*func)(void *), void *arg, gpio::InterruptType type) const {
  // TODO
}

static uint16_t initialized_ports = 0;

void _pin_mode(uint8_t pin, gpio::Flags flags, optional<uint8_t> af) {
  uint16_t port_index = pin >> 4;
  uint16_t port_mask = 1 << port_index;
  if (!(initialized_ports & port_mask)) {
    switch (port_index) {
      case 0:
#ifdef __HAL_RCC_GPIOA_CLK_ENABLE
        __HAL_RCC_GPIOA_CLK_ENABLE();
#endif
        break;
      case 1:
#ifdef __HAL_RCC_GPIOB_CLK_ENABLE
        __HAL_RCC_GPIOB_CLK_ENABLE();
#endif
        break;
      case 2:
#ifdef __HAL_RCC_GPIOC_CLK_ENABLE
        __HAL_RCC_GPIOC_CLK_ENABLE();
#endif
        break;
      case 3:
#ifdef __HAL_RCC_GPIOD_CLK_ENABLE
        __HAL_RCC_GPIOD_CLK_ENABLE();
#endif
        break;
      case 4:
#ifdef __HAL_RCC_GPIOE_CLK_ENABLE
        __HAL_RCC_GPIOE_CLK_ENABLE();
#endif
        break;
      case 5:
#ifdef __HAL_RCC_GPIOF_CLK_ENABLE
        __HAL_RCC_GPIOF_CLK_ENABLE();
#endif
        break;
      case 6:
#ifdef __HAL_RCC_GPIOG_CLK_ENABLE
        __HAL_RCC_GPIOG_CLK_ENABLE();
#endif
        break;
      case 7:
#ifdef __HAL_RCC_GPIOH_CLK_ENABLE
        __HAL_RCC_GPIOH_CLK_ENABLE();
#endif
        break;
      case 8:
#ifdef __HAL_RCC_GPIOI_CLK_ENABLE
        __HAL_RCC_GPIOI_CLK_ENABLE();
#endif
        break;
    }
    initialized_ports |= port_mask;
  }
  GPIO_TypeDef *port = pin_to_port(pin);
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = pin_to_mask(pin);
  if (flags & gpio::Flags::FLAG_INPUT) {
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  } else {
    if (!af) {
      GPIO_InitStruct.Mode = flags & gpio::Flags::FLAG_OPEN_DRAIN ? GPIO_MODE_OUTPUT_OD : GPIO_MODE_OUTPUT_PP;
    } else {
      GPIO_InitStruct.Mode = flags & gpio::Flags::FLAG_OPEN_DRAIN ? GPIO_MODE_AF_OD : GPIO_MODE_AF_PP;
    }
  }
  GPIO_InitStruct.Pull = (flags & gpio::Flags::FLAG_PULLUP)
                             ? GPIO_PULLUP
                             : ((flags & gpio::Flags::FLAG_PULLDOWN) ? GPIO_PULLDOWN : GPIO_NOPULL);
// TODO
#ifndef F1
  if (af) {
    GPIO_InitStruct.Alternate = *af;
  }
#endif

#ifdef GPIO_SPEED_HIGH
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
#endif

  if (port) {
    HAL_GPIO_Init(port, &GPIO_InitStruct);
  }
}

bool _digital_read(uint8_t pin) {
  GPIO_TypeDef *port = pin_to_port(pin);
  return HAL_GPIO_ReadPin(port, pin_to_mask(pin));
}

void _digital_write(uint8_t pin, bool value) {
  GPIO_TypeDef *port = pin_to_port(pin);
  if (port) {
    HAL_GPIO_WritePin(port, pin_to_mask(pin), value ? GPIO_PIN_SET : GPIO_PIN_RESET);
  }
}
void STM32GPIOPin::pin_mode(gpio::Flags flags) { _pin_mode(pin_, flags, af_); }

void STM32GPIOPin::digital_write(bool value) { _digital_write(pin_, value != inverted_); }

std::string STM32GPIOPin::dump_summary() const {
  char buffer[32];
  snprintf(buffer, sizeof(buffer), "P%c%u", 'A' + (pin_ >> 4), pin_ & 0xf);
  return buffer;
}

bool STM32GPIOPin::digital_read() { return _digital_read(pin_) != inverted_; }

void STM32GPIOPin::detach_interrupt() const {
  // TODO
}

}  // namespace stm32

using namespace stm32;

void IRAM_ATTR ISRInternalGPIOPin::pin_mode(gpio::Flags flags) {
  auto pin_ = ((struct ISRPinArg *) arg_)->pin;
  // TODO - passing false for af
  _pin_mode(pin_, flags, false);
}

bool IRAM_ATTR ISRInternalGPIOPin::digital_read() {
  auto ptr = ((struct ISRPinArg *) arg_);
  return bool(ptr->inverted) != _digital_read(ptr->pin);
}

void IRAM_ATTR ISRInternalGPIOPin::digital_write(bool value) {
  auto ptr = ((struct ISRPinArg *) arg_);
  _digital_write(ptr->pin, value != bool(ptr->inverted));
}

void IRAM_ATTR ISRInternalGPIOPin::clear_interrupt() {
  // TODO
}

}  // namespace esphome

#endif  // USE_STM32
